app/views/books/_favorites.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
    <%= link_to book_favorites_path(book), method: :delete,remote: true do %>
      <span class="glyphicon glyphicon-heart"><%= book.favorites.count%></span>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
    <%= link_to book_favorites_path(book), method: :post,remote: true do %>
      <span class="glyphicon glyphicon-heart-empty"><%= book.favorites.count %></span>