app/views/books/index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
                          <!-- いいね機能 -->
                          <td>コメント数：<%= book.book_comments.count %></td>