app/controllers/books_controller.rb

  def index
      @user = current_user
      @book = Book.new
      @books =Book.all
      @users =User.all
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id)
      flash[:notice] = 'You have creatad book successfully.'
    else
      @user = current_user
      @books =Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "試しの投稿"], ["body", "ハート確認"], ["user_id", 3], ["created_at", "2020-08-10 11:04:19.190888"], ["updated_at", "2020-08-10 11:04:19.190888"]]
SELECT "books".* FROM "books"