app/controllers/favorites_controller.rb

	def create
    	@favorite = current_user.favorites.new(book_id: @book.id)
    	@favorite.save
---
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 1], ["created_at", "2020-08-08 06:09:38.643349"], ["updated_at", "2020-08-08 06:09:38.643349"]]

	def destroy
	     @favorite = current_user.favorites.find_by(book_id: @book.id)
	     @favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 4]]

	def set_book
	    @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]