app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@users=User.all
		@user =User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", "ea692ff98735f5d8bd9db7d3b5f79f31ad8ac10d0c948046d834ecc87c13"], ["updated_at", "2020-07-28 06:04:10.435505"], ["id", 8]]
---
	def update
		    user =User.find(params[:id])
	     if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def follower_users
    	@users=User.find(params[:id]).follower_user

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def follow_users
    	@users=User.find(params[:id]).following_user